Repository: Bassant13/news_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# home_title
source: Home
ar: الصفحة الرئيسية

# home_second_title
source: Good Morning! Here is Some News For You
ar: صباح الخير! إليك بعض الأخبار لك.

source: General
ar: العامة

source: Business
ar: التجارة

source: Sports
ar: الرياضة

source: Health
ar: الصحة

source: Entertainment
ar: الترفيه

source: Technology
ar: التكنولوجيا

source: Science
ar: العلوم

source: View All
ar: عرض الكل

source: News App
ar: تطبيق الأخبار

source: Go To Home
ar: الصفحة الرئيسية

source: Theme
ar: السمات

source: Language
ar: اللغة

source: BBC News
ar: بي بي سي نيوز

source: CNN
ar: سي إن إن

source: Fox News
ar: فوكس نيوز

# al_jazeera
source: Al Jazeera English
ar: الجزيرة

source: Reuters
ar: رويترز

source: TechCrunch
ar: تيك كرانش

source: Wired
ar: وايرد

source: ESPN
ar: إي إس بي إن

source: Bleacher Report
ar: بليتشر ريبورت

source: National Geographic
ar: ناشيونال جيوغرافيك

source: Light
ar: الوضع الفاتح

source: Dark
ar: الوضع الداكن

source: View Full Article
ar: عرض المقال الكامل

# minutes_ago
source: 15 minutes ago
ar: قبل 15 دقيقة

# global_markets_article_title
source: Global Markets See Sharp Decline
ar: الأسواق العالمية تشهد تراجعًا حادًا

# new_tech_article_title
source: New Tech Innovations in 2025
ar: الابتكارات التكنولوجية الجديدة في عام 2025

# ai_startups_article_title
source: AI Startups Are Booming
ar: الشركات الناشئة في مجال الذكاء الاصطناعي تزدهر

# champions_league_article_title
source: Champions League: Exciting Quarter-Final Matches
ar: دوري الأبطال: مباريات ربع نهائي مثيرة

# middle_east_article_title
source: Middle East Tensions Rise Amid Political Unrest
ar: تصاعد التوترات في الشرق الأوسط وسط اضطرابات سياسية

# scientists_discover_article_title
source: Scientists Discover a New Deep-Sea Creature
ar: علماء يكتشفون مخلوقًا جديدًا في أعماق البحار

# global_markets_article_desc
source: Stock markets around the world have seen a sharp decline due to economic concerns.
ar: شهدت أسواق الأسهم حول العالم تراجعًا حادًا بسبب المخاوف الاقتصادية

# new_tech_article_desc
source: Tech companies are unveiling groundbreaking innovations that will shape the future.
ar: تقوم شركات التكنولوجيا بالكشف عن ابتكارات رائدة ستشكل مستقبل العالم

# ai_startups_article_desc
source: Artificial intelligence startups are attracting major investment in 2025.
ar: شركات الذكاء الاصطناعي الناشئة تجذب استثمارات كبيرة في عام 2025

# champions_league_article_desc
source: Football fans are thrilled as top teams clash in the Champions League quarter-finals.
ar: تتزايد الإثارة بين عشاق كرة القدم مع اقتراب مباريات ربع نهائي دوري أبطال أوروبا 2025، حيث ستشهد مواجهات مثيرة بين أبرز الأندية الأوروبية

# middle_east_article_desc
source: Political unrest continues in the Middle East as world leaders call for peace.
ar: استمرار الاضطرابات السياسية في الشرق الأوسط مع دعوات من قادة العالم من أجل السلام

# scientists_discover_article_desc
source: A mysterious deep-sea creature has been discovered in the Pacific Ocean.
ar: تم اكتشاف مخلوق غريب في أعماق البحر في المحيط الهادئ

# global_markets_article_auth
source: By: John Doe
ar: بواسطة: جون دو

# new_tech_article_auth
source: By: Jane Smith
ar: بواسطة: جين سميث

# ai_startups_article_auth
source: By: Emily Johnson
ar: بواسطة: إميلي جونسون

# champions_league_article_auth
source: By: Michael Brown
ar: بواسطة: مايكل براون

# middle_east_article_auth
source: By: Ahmed Ali
ar: بواسطة: أحمد علي

# scientists_discover_article_auth
source: By: Sarah Adams
ar: بواسطة: سارة آدامز
